In [3]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

# Using concat

In [8]:
df2=pd.DataFrame({'Name':"Anil",'Marks':[99]})
df3=pd.concat([df1,df2])
df3

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
0     Anil     99

# Using Append

In [9]:
row1={'Name':'AKS','Marks':99}
df1=df1.append(row1,ignore_index=True)
df1

AttributeError: 'DataFrame' object has no attribute 'append'

# Using iloc

In [10]:
df1.iloc[0]=['aks',89]
df1

      Name  Marks
0      aks     89
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [11]:
df1.iloc[1]=['Sat',90]
df1

      Name  Marks
0      aks     89
1      Sat     90
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

# Using loc.

In [12]:
df1.loc[2]=['rith',100]
df1

      Name  Marks
0      aks     89
1      Sat     90
2     rith    100
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

# Remove rows from  pandas dataframe.

df1.drop([0,1],inplace=True)

In [14]:
df1

      Name  Marks
2     rith    100
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [15]:
df1.reset_index(drop=True)

      Name  Marks
0     rith    100
1   Vedant     87
2   Parshv     90
3   Mittal     83
4  Archana     82

# drops rows based on condition

In [24]:
df1.drop(df1[df1['Marks']<90].index)

     Name  Marks
2    rith    100
4  Parshv     90

In [25]:
df1

      Name  Marks
2     rith    100
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82